In [302]:
import numpy as np
import pandas as pd

In [303]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [304]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [305]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [306]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [307]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [308]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [309]:
ser1 = pd.Series([1,2,3,4],['usa','germany','ussr','japan'])
ser1

usa        1
germany    2
ussr       3
japan      4
dtype: int64

In [310]:
ser1[0]

1

In [311]:
from numpy.random import randn
np.random.seed(5)

df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [312]:
# 데이터 프레임의 컬럼 불러오기 연습
df[['W']+['X']+['Y']+['Z']]

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [313]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  0.441227 -0.330870  2.430771 -0.252092  2.871999
B  0.109610  1.582481 -0.909232 -0.591637 -0.799623
C  0.187603 -0.329870 -1.192765 -0.204877 -1.005161
D -0.358829  0.603472 -1.664789 -0.700179 -2.023617
E  1.151391  1.857331 -1.511180  0.644848 -0.359789

# Pandas의 dataframe을 통해 column 삭제

In [314]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [315]:
df.drop('new',axis=1, inplace=True)
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [316]:
df.drop('E', axis=0)

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179

In [317]:
df.shape

(5, 4)

- Tuple 형태
- 앞에 5는 row 수, 해당 인덱스는 0
- Axis는 축이라는 뜻

In [318]:
df.loc[['A']]

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092

In [319]:
df.iloc[2]

W    0.187603
X   -0.329870
Y   -1.192765
Z   -0.204877
Name: C, dtype: float64

In [320]:
df.loc['B'][2]

-0.9092324048562419

- Dataframe의 conditional selection(조건부 선택)

In [321]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.441227  2.430771
B  0.109610 -0.909232

In [420]:
df[(df['W']>0)&(df['Y']>1)]

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092